
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	
	МассивНазначения = Новый Массив;
	МассивНазначения.Добавить("Документ.КадровыйПеревод"); 
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначения);
	
	ПараметрыРегистрации.Вставить("Вид", "ПечатнаяФорма");
	ПараметрыРегистрации.Вставить("Наименование", "ШаблонWord_ДС_оклад_должность");
	ПараметрыРегистрации.Вставить("Информация", "ШаблонWord_ДС_оклад_должность");
	ПараметрыРегистрации.Вставить("Версия", "1.0");  
	ПараметрыРегистрации.Вставить("ВерсияБСП", "1.2.1.4");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	
	ТаблицаКоманд = Новый ТаблицаЗначений;
	ТаблицаКоманд.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка")); 
	ТаблицаКоманд.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка")); 
	ТаблицаКоманд.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	ТаблицаКоманд.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("ЗаменяемыеКоманды", Новый ОписаниеТипов("Строка"));
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = "ШаблонWord_ДС_оклад_должность"; 
	НоваяКоманда.Идентификатор = "ШаблонWord_ДС_оклад_должность";
	НоваяКоманда.Использование = "ВызовКлиентскогоМетода";
	НоваяКоманда.ПоказыватьОповещение = Истина;
	НоваяКоманда.Модификатор = "";
	НоваяКоманда.ЗаменяемыеКоманды = "";
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции