


&НаКлиенте
Процедура Печать(ИдентификаторКоманды, ОбъектыНазначения) Экспорт
	
	Если ИдентификаторКоманды = "ШаблонWord_ДС_оклад_должность" Тогда
		
		ИмяМакета = "ПФ_DOC_Договор";
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ПроверитьПроведенностьЗавершение", 
			ЭтотОбъект, Новый Структура("ИмяМакета", ИмяМакета));
		
		УправлениеПечатьюКлиент.ПроверитьПроведенностьДокументов(ОписаниеОповещения, ОбъектыНазначения, ВладелецФормы);
		
	КонецЕсли;			
	                                
КонецПроцедуры 

&НаКлиенте
Процедура ПроверитьПроведенностьЗавершение(ОбъектыНазначения, ДополнительныеПараметры) Экспорт
	
	ИмяМакета = ДополнительныеПараметры.ИмяМакета;
	
	МассивИменМакетов = Новый Массив;
	МассивИменМакетов.Добавить(ИмяМакета);
	МакетыИДанныеОбъекта = ПолучитьДанныеПечати(ОбъектыНазначения, МассивИменМакетов);
	
	ТипМакета = МакетыИДанныеОбъекта.Макеты.ТипыМакетов[ИмяМакета];	
	Области = МакетыИДанныеОбъекта.Макеты.ОписаниеОбластей; 					
	ДвоичныеДанныеМакета = МакетыИДанныеОбъекта.Макеты.ДвоичныеДанныеМакетов[ИмяМакета];	
	
	Макет = УправлениеПечатьюКлиент.ИнициализироватьМакетОфисногоДокумента(ДвоичныеДанныеМакета, ТипМакета, ИмяМакета);
	
	Если Макет <> Неопределено Тогда
			
		Для Каждого ДокументСсылка Из ОбъектыНазначения Цикл	
		
			ДанныеОбъекта = МакетыИДанныеОбъекта.Данные[ДокументСсылка][ИмяМакета];					
			
			ЗакрытьОкноПечатнойФормы = Ложь;
			
			Попытка
				
				ПечатнаяФорма = УправлениеПечатьюКлиент.ИнициализироватьПечатнуюФорму(ТипМакета, Макет.НастройкиСтраницыМакета, Макет);
				
				Если ПечатнаяФорма = Неопределено Тогда
					УправлениеПечатьюКлиент.ОчиститьСсылки(Макет);
					Возврат;
				КонецЕсли;
						
				// Вывод заголовка документа.
				Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["Заголовок"]);
				УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);						
				УправлениеПечатьюКлиент.ПоказатьДокумент(ПечатнаяФорма);
				
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗакрытьОкноПечатнойФормы = Истина;			
			КонецПопытки;
			
			УправлениеПечатьюКлиент.ОчиститьСсылки(ПечатнаяФорма, ЗакрытьОкноПечатнойФормы);
				
		КонецЦикла;		
					
	КонецЕсли;   
	
	УправлениеПечатьюКлиент.ОчиститьСсылки(Макет);	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПечати(Знач МассивДокументов, Знач МассивИменМакетов) Экспорт
	
	ДанныеПоВсемОбъектам = Новый Соответствие;
	
	Для Каждого ОбъектСсылка Из МассивДокументов Цикл
		ДанныеОбъектаПоМакетам = Новый Соответствие;
		Для Каждого ИмяМакета Из МассивИменМакетов Цикл
			ДанныеОбъектаПоМакетам.Вставить(ИмяМакета, ПолучитьДанныеОбъекта(ОбъектСсылка));
		КонецЦикла;
		ДанныеПоВсемОбъектам.Вставить(ОбъектСсылка, ДанныеОбъектаПоМакетам);
	КонецЦикла;
	
	ОписаниеОбластей = Новый Соответствие;
	ДвоичныеДанныеМакетов = Новый Соответствие;
	ТипыМакетов = Новый Соответствие;
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Для Каждого ИмяМакета Из МассивИменМакетов Цикл
		ДвоичныеДанныеМакета = ОбработкаОбъект.ПолучитьМакет(ИмяМакета);
		ДвоичныеДанныеМакетов.Вставить(ИмяМакета, ДвоичныеДанныеМакета);
		Позиция = Найти(ИмяМакета, "_");
		Подстрока = Сред(ИмяМакета, Позиция + 1, СтрДлина(ИмяМакета) - Позиция); 
		Позиция = Найти(Подстрока, "_");
		ТипМакета = Лев(Подстрока, Позиция - 1); 
		ТипыМакетов.Вставить(ИмяМакета, ТипМакета);
		ОписаниеОбластей.Вставить(ИмяМакета, ПолучитьОписаниеОбластейМакетаОфисногоДокумента());
	КонецЦикла;
	
	Макеты = Новый Структура;
	Макеты.Вставить("ОписаниеОбластей", ОписаниеОбластей);
	Макеты.Вставить("ТипыМакетов", ТипыМакетов);
	Макеты.Вставить("ДвоичныеДанныеМакетов", ДвоичныеДанныеМакетов);
	
	Результат = Новый Структура;	
	Результат.Вставить("Данные", ДанныеПоВсемОбъектам);
	Результат.Вставить("Макеты", Макеты);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеОбъекта(СсылкаНаДокумент)
		
	СтруктураДат = Неопределено;
	ТекСсылкаНаДокумент = СсылкаНаДокумент;
	Если ТипЗнч(СсылкаНаДокумент) <> Тип("СправочникСсылка.Сотрудники") тогда
		ТекСсылкаНаДокумент = СсылкаНаДокумент.Сотрудник;
		СтруктураДат = СсылкаНаДокумент.ДатаНачала;
	КонецЕсли;
	ТекМассивСыслокНаДокумент = Новый Массив;
	ТекМассивСыслокНаДокумент.Добавить(ТекСсылкаНаДокумент);
	
	ДанныеДоговоров_ = ДанныеТрудовыхДоговоров_(ТекМассивСыслокНаДокумент, Ложь, Ложь, СтруктураДат);
	
	//Сообщить(ДанныеДоговоров_.Количество());
	
	//scoms удалим повторяющиеся элементы массива
	ДанныеДоговоров = УдалитьПовторяющиесяЭлементыМассива(ДанныеДоговоров_);
	
	ДанныеОбъекта = Новый Структура();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Сотрудник КАК Сотрудник,
	|	&ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Сотрудник КАК Сотрудник,
	|	ВТ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЕСТЬNULL(ОсновныеДанныеКонтрактаДоговораСотрудникаСрезПоследних.ДатаДоговораКонтракта, ДАТАВРЕМЯ(1, 1, 1)) КАК ТрудовойДоговорДата,
	|	ЕСТЬNULL(ОсновныеДанныеКонтрактаДоговораСотрудникаСрезПоследних.НомерДоговораКонтракта, """") КАК ТрудовойДоговорНомер,
	|	ЕСТЬNULL(ФизическиеЛицаКонтактнаяИнформация.Представление, """") КАК Адрес
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеДанныеКонтрактаДоговораСотрудника.СрезПоследних(, Сотрудник = &Сотрудник) КАК ОсновныеДанныеКонтрактаДоговораСотрудникаСрезПоследних
	|		ПО ВТ.Сотрудник = ОсновныеДанныеКонтрактаДоговораСотрудникаСрезПоследних.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|		ПО ВТ.ФизическоеЛицо = ФизическиеЛицаКонтактнаяИнформация.Ссылка
	|			И (ФизическиеЛицаКонтактнаяИнформация.Вид = &ВидКИ)
	|			И (ФизическиеЛицаКонтактнаяИнформация.Тип = &ТипКИ)"; 
	
	
	Запрос.УстановитьПараметр("Сотрудник", ТекСсылкаНаДокумент);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ТекСсылкаНаДокумент.ФизическоеЛицо);
	Запрос.УстановитьПараметр("ВидКИ", Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица);
	Запрос.УстановитьПараметр("ТипКИ", Перечисления.ТипыКонтактнойИнформации.Адрес);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		ДанныеОбъекта.Вставить("ДатаДоговора", Формат(ВыборкаДетальныеЗаписи.ТрудовойДоговорДата, "ДФ='''""''dd''""'' MMMM yyyy ""г.""'"));	    
		ДанныеОбъекта.Вставить("НомерДоговора", СокрЛП(ВыборкаДетальныеЗаписи.ТрудовойДоговорНомер));
		ДанныеОбъекта.Вставить("АдресРегистрации",   ВыборкаДетальныеЗаписи.Адрес);
		ДанныеОбъекта.Вставить("ДатаРождения",  Формат(ВыборкаДетальныеЗаписи.ФизическоеЛицо.ДатаРождения, "ДФ=dd.MM.yyyy"));
		//ДанныеОбъекта.Вставить("ВремяС",   "9.00");
		//ДанныеОбъекта.Вставить("ВремяПо",   "18.00");

		//Попытка   
		//	
		//	Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сотрудник.С) Тогда
		//		ДанныеОбъекта.Вставить("ВремяС",   СокрЛП(ВыборкаДетальныеЗаписи.Сотрудник.С)); 
		//	КонецЕсли;
		//
		//	Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сотрудник.По) Тогда
		//		ДанныеОбъекта.Вставить("ВремяПо",   СокрЛП(ВыборкаДетальныеЗаписи.Сотрудник.ПО)); 
		//	КонецЕсли;
		//	
		//Исключение
		//КонецПопытки;

		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыДокументовФизическихЛиц.Ссылка КАК Ссылка,
		|	ВидыДокументовФизическихЛиц.Наименование КАК Наименование
		|ПОМЕСТИТЬ ВидыДокументов
		|ИЗ
		|	Справочник.ВидыДокументовФизическихЛиц КАК ВидыДокументовФизическихЛиц
		|ГДЕ
		|	ВидыДокументовФизическихЛиц.Наименование ПОДОБНО ""Паспорт гражданина%""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
		|	ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
		|	ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество
		|ИЗ
		|	РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&Период, ФизическоеЛицо = &Физлицо) КАК ФИОФизическихЛицСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументыФизическихЛицСрезПоследних.Серия КАК Серия,
		|	ДокументыФизическихЛицСрезПоследних.Номер КАК Номер,
		|	ДокументыФизическихЛицСрезПоследних.КодПодразделения КАК КодПодразделения,
		|	ДокументыФизическихЛицСрезПоследних.КемВыдан КАК ОрганВыдан,
		|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи КАК ДатаВыдачи,
		|	ВидыДокументов.Наименование КАК ВидДокумента
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
		|			&Период,
		|			Физлицо = &Физлицо
		|				И ВидДокумента В
		|					(ВЫБРАТЬ
		|						ВидыДокументов.Ссылка КАК Ссылка
		|					ИЗ
		|						ВидыДокументов КАК ВидыДокументов)) КАК ДокументыФизическихЛицСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыДокументов КАК ВидыДокументов
		|		ПО ДокументыФизическихЛицСрезПоследних.ВидДокумента = ВидыДокументов.Ссылка";
		
		Запрос.УстановитьПараметр("Период", ТекущаяДата());
		Запрос.УстановитьПараметр("Физлицо", ВыборкаДетальныеЗаписи.ФизическоеЛицо);		
		
		МассивПакетов = Запрос.ВыполнитьПакет();
		
		Если МассивПакетов[1].Пустой() Тогда
			ДанныеФИО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыборкаДетальныеЗаписи.ФизическоеЛицо, "Фамилия, Имя, Отчество");		
		Иначе
			ДанныеФИО = МассивПакетов[1].Выбрать();
			ДанныеФИО.Следующий();
		КонецЕсли;				
		
		Если МассивПакетов[2].Пустой() Тогда
			СерияДокумента = "";
			НомерДокумента = "";
			КодПодразделения = "";
			ОрганВыдачи = "";
			ДатаВыдачи = "";
			ВидДокумента = НСтр("ru = 'Паспорт'");
		Иначе
			ДанныеДокумента = МассивПакетов[2].Выбрать();        
			ДанныеДокумента.Следующий();
			СерияДокумента = ДанныеДокумента.Серия;
			НомерДокумента = ДанныеДокумента.Номер;
			Если ЗначениеЗаполнено(НомерДокумента) Тогда
				НомерДокумента = НСтр("ru = '№'") + НомерДокумента;
			КонецЕсли;
			КодПодразделения = ДанныеДокумента.КодПодразделения;
			Если ЗначениеЗаполнено(КодПодразделения) Тогда
				КодПодразделения = НСтр("ru = ', Код подр.'") + КодПодразделения;
			КонецЕсли;
			ОрганВыдачи = ДанныеДокумента.ОрганВыдан;
			ДатаВыдачи = Формат(ДанныеДокумента.ДатаВыдачи, "ДФ='dd.MM.yyyy ""г.""'");
			ВидДокумента = ДанныеДокумента.ВидДокумента;
		КонецЕсли;
		
		ДанныеОбъекта.Вставить("Серия", СерияДокумента);
		ДанныеОбъекта.Вставить("Номер", НомерДокумента);
		ДанныеОбъекта.Вставить("КодПодразделения", КодПодразделения);										
		ДанныеОбъекта.Вставить("ОрганВыдачи", ОрганВыдачи);										
		ДанныеОбъекта.Вставить("ДатаВыдачи", ДатаВыдачи);										
		ДанныеОбъекта.Вставить("ФИО", ФИОИзЧастей(ДанныеФИО));
		ДанныеОбъекта.Вставить("ВидДокумента", ВидДокумента);
		
		
		// ищем размер оклада
		ТекРазмерОклада = 0;
		
		ЗапросОклад = Новый Запрос;
		ЗапросОклад.Текст =
		"ВЫБРАТЬ
		|	ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковСрезПоследних.Регистратор КАК Регистратор,
		|	ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
		|	ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковСрезПоследних.Организация КАК Организация,
		|	ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковСрезПоследних.Показатель КАК Показатель,
		|	ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковСрезПоследних.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников.СрезПоследних(
		|			&Период,
		|			Сотрудник = &ТекСотрудник
		|				И Показатель = &Оклад) КАК ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковСрезПоследних";
		
		ЗапросОклад.УстановитьПараметр("ТекСотрудник", ВыборкаДетальныеЗаписи.Сотрудник);
		ЗапросОклад.УстановитьПараметр("Период", КонецДня(СтруктураДат));
		ЗапросОклад.УстановитьПараметр("Оклад", Справочники.ПоказателиРасчетаЗарплаты.Оклад);
		
		РезультатОклад = ЗапросОклад.Выполнить().Выбрать();
		Пока РезультатОклад.Следующий() цикл
			ТекРазмерОклада = РезультатОклад.Значение;	
		КонецЦикла;
		
		// ищем должность 
		
		ТекДолжность = "";
		
		ЗапросДолжность = Новый Запрос;
		ЗапросДолжность.Текст =
		"ВЫБРАТЬ
		|	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
		|	КадроваяИсторияСотрудниковСрезПоследних.Регистратор КАК Регистратор,
		|	КадроваяИсторияСотрудниковСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
		|	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность,
		|	КадроваяИсторияСотрудниковСрезПоследних.Подразделение КАК Подразделение
		|ИЗ
		|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&Период, Сотрудник = &ТекСотрудник) КАК КадроваяИсторияСотрудниковСрезПоследних";
		
		ЗапросДолжность.УстановитьПараметр("ТекСотрудник", ВыборкаДетальныеЗаписи.Сотрудник);
		ЗапросДолжность.УстановитьПараметр("Период", КонецДня(СтруктураДат));
		
		РезультатДолжность = ЗапросДолжность.Выполнить().Выбрать();
		Пока РезультатДолжность.Следующий() цикл
			ТекДолжность = РезультатДолжность.Должность;		
		КонецЦикла;
		
		ДанныеОбъекта.Вставить("ДатаДокументаПеревода", Формат(СтруктураДат, "ДФ='''""''dd''""'' MMMM yyyy ""г.""'"));
		
		ДанныеОбъекта.Вставить("ДолжностьСотрудника", ТекДолжность);
		ДанныеОбъекта.Вставить("СуммаОклада", Строка(ТекРазмерОклада));
		
		ТекСуммаОкладаПрописью = ЧислоПрописью(ТекРазмерОклада, "Л=ru_RU;ДП=Истина", 
		"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
		ДанныеОбъекта.Вставить("СуммаОкладаПрописью", ТекСуммаОкладаПрописью);
		
		//Для каждого ТекДанныеДоговора из ДанныеДоговоров цикл
			//ДанныеОбъекта.Вставить("ДолжностьСотрудника", ТекДанныеДоговора.Должность);
			//ДанныеОбъекта.Вставить("СуммаОклада", Строка(ТекДанныеДоговора.ТарифнаяСтавкаРазмер));
			//ДанныеОбъекта.Вставить("ДолжностьСотрудника", ТекДолжность);
			//ДанныеОбъекта.Вставить("СуммаОклада", Строка(ТекРазмерОклада));
			//
			//ТекСуммаОкладаПрописью = ЧислоПрописью(ТекРазмерОклада, "Л=ru_RU;ДП=Истина", 
			//"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
			//ДанныеОбъекта.Вставить("СуммаОкладаПрописью", ТекСуммаОкладаПрописью);
		//КонецЦикла;
		
		Инициалы = ИнициалыПоИмениОтчеству(ДанныеФИО.Имя, ДанныеФИО.Отчество);
		
		Если ПустаяСтрока(Инициалы) Тогда
			ФамилияИнициалы = ДанныеФИО.Фамилия;
		Иначе
			ФамилияИнициалы =  ДанныеФИО.Фамилия + " " + Инициалы;
		КонецЕсли;
		
		ДанныеОбъекта.Вставить("ФИОСокр", ФамилияИнициалы);	
		ДанныеОбъекта.Вставить("ФИОСклонение", СклонениеПредставленийОбъектов.ПросклонятьФИО(ФИОИзЧастей(ДанныеФИО), 5,,));
		//ДанныеОбъекта.Вставить("ФамилияИнициалы", ФамилияИнициалы);		
		//ДанныеОбъекта.Вставить("Сумма", Формат(ВыборкаДетальныеЗаписи.Сумма, "ЧДЦ=2; ЧРД=,; ЧН=; ЧГ=3,0"));
		//ДанныеОбъекта.Вставить("СуммаПрописью", ЧислоПрописью(ВыборкаДетальныеЗаписи.Сумма, "Л = ru_RU", НСтр("ru='рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2'")));		
		//ДанныеОбъекта.Вставить("НДФЛ", Формат(ВыборкаДетальныеЗаписи.НДФЛ, "ЧДЦ=2; ЧРД=,; ЧН=; ЧГ=3,0"));
		//ДанныеОбъекта.Вставить("НДФЛПрописью", ЧислоПрописью(ВыборкаДетальныеЗаписи.НДФЛ, "Л = ru_RU", НСтр("ru='рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2'")));
	    		ИменаПолей =
		"НаимЮЛСокр,
		|НаимЮЛПол,
		|ЭтоЮридическоеЛицо,
		|ГоловнаяОрганизация,
		|ОГРН,
		|ИННЮЛ,
		|КППЮЛ,
		|АдрПочт,
		|АдрПочт_JSON,
		|ТелОрганизации,
		|ТелОрганизации_JSON,
		|АдрЮР,
		|АдрЮР_JSON,
		|ИндивидуальныйПредприниматель,
		|РукСсылка,
		|ДолжнРук";

		СведенияОбОрганизации = ЗарплатаКадры.СведенияОбОрганизации(ТекСсылкаНаДокумент.ГоловнаяОрганизация, ИменаПолей, ТекущаяДатаСеанса());
		
		ДанныеОбъекта.Вставить("ОГРН"				, СведенияОбОрганизации.ОГРН);	
		ДанныеОбъекта.Вставить("ИНН"				, СведенияОбОрганизации.ИННЮЛ);	
		ДанныеОбъекта.Вставить("КПП"				, СведенияОбОрганизации.КППЮЛ);	
		//ДанныеОбъекта.Вставить("ЮрАдрес"			, СведенияОбОрганизации.АдрЮР);
		
		ЮрАдрес = СтрЗаменить(ДанныеДоговоров[0].ОрганизацияАдресЮридический, "Город Москва", "г. Москва");
		ДанныеОбъекта.Вставить("ЮрАдрес"			, ЮрАдрес);
		ДанныеОбъекта.Вставить("ТелОрганизации"		, СведенияОбОрганизации.ТелОрганизации);	
		ДанныеОбъекта.Вставить("НаименованиеОрганизацииСокр"	, СведенияОбОрганизации.НаимЮЛСокр);
		ДанныеОбъекта.Вставить("НаименованиеОрганизации"		, СведенияОбОрганизации.НаимЮЛПол);   
		
		
		ЗапрашиваемыеЗначения = Новый Структура("Организация,Руководитель");
		ЗапрашиваемыеЗначения.Организация = ТекСсылкаНаДокумент.ГоловнаяОрганизация;
		ПодписиДокументов.ЗаполнитьСведенияОПодписяхДокументовПоОрганизации(ЗапрашиваемыеЗначения);
		
		ФамРук = "";     
		ИницРук = "";
		Если  ЗначениеЗаполнено(ЗапрашиваемыеЗначения.Руководитель) Тогда
		
			ФамРук   =      ЗапрашиваемыеЗначения.Руководитель.Фамилия;
			ИницРук  =      ЗапрашиваемыеЗначения.Руководитель.Инициалы;    
			
			ДанныеФИО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗапрашиваемыеЗначения.Руководитель, "Фамилия, Имя, Отчество");		
			ДанныеОбъекта.Вставить("РуководительФИО"		, СклонениеПредставленийОбъектов.ПросклонятьФИО(ФИОИзЧастей(ДанныеФИО), 2,,)); 
			
		КонецЕсли;

		ДанныеОбъекта.Вставить("Руководитель"			,ФамРук + " " + ИницРук);
		
		
			КонецЕсли;		
	//ДанныеОбъекта = Новый Структура;
	Возврат ДанныеОбъекта;
	
КонецФункции

Функция ФИОИзЧастей(ЧастиИмени) Экспорт
	Возврат ЧастиИмени.Фамилия + " " +
	        ЧастиИмени.Имя + " " +
	        ЧастиИмени.Отчество;
		КонецФункции
		
Функция СоставныеЧастиИмени(Знач Имя)
	
	Имена = Новый Массив;
	
	Если Не ПустаяСтрока(Имя) Тогда
		
		РазделительИмен = "-";
		ПозицияРазделителя = СтрНайти(Имя, РазделительИмен);
		Если ПозицияРазделителя = 0 Тогда
			РазделительИмен = " ";
			ПозицияРазделителя = СтрНайти(Имя, РазделительИмен);
		КонецЕсли;
		
		Имена = СтрРазделить(Имя, РазделительИмен, Ложь);
		
	КонецЕсли;
	
	Возврат Имена;
	
КонецФункции

// Формирует инициалы имени и отчества физического лица.
//
// Параметры:
//  Имя			- Строка;
//  Отчество	- Строка;
//
// Возвращаемое значение:
//  Строка - инициал имени, отчества.
//
Функция ИнициалыПоИмениОтчеству(Знач Имя, Знач Отчество) Экспорт
	
	Если Не ПустаяСтрока(Имя) Тогда
		
		Имена = СоставныеЧастиИмени(Имя);
		Если Имена.Количество() > 1 Тогда
			
			Инициалы = Лев(Имена[0], 1) + ".-"
				+ Лев(Имена[1], 1) + ".";
			
		Иначе
			Инициалы = Лев(Имя, 1) + ".";
		КонецЕсли;
		
		Если Не ПустаяСтрока(Отчество) Тогда
			Инициалы = Инициалы + " " + Лев(Отчество, 1) + ".";
		КонецЕсли;
		
		Возврат Инициалы;
		
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаСервере
Функция ПолучитьОписаниеОбластейМакетаОфисногоДокумента()
	
	ОписаниеОбластей = Новый Структура;	
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Заголовок", "Общая");	
	Возврат ОписаниеОбластей;
	
КонецФункции


&НаСервере
Функция ДанныеТрудовыхДоговоров_(МассивОбъектов, ДистанционныеРаботы, ДоговорСНадомником, СтруктураДат) Экспорт
	
	ДанныеТрудовыхДоговоров = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	МассивПриказовОПриеме = Новый Массив;
	
	ИспользоватьКадровыйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьКадровыйУчет");
	ВыводПоСсылкеНаСотрудника = Ложь;
	
	//Сообщить(ТипЗнч(МассивОбъектов[0]));
	Если ТипЗнч(МассивОбъектов[0]) = Тип("СправочникСсылка.Сотрудники") Тогда
		
		ВыводПоСсылкеНаСотрудника = Истина;
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
			|	Сотрудники.Ссылка КАК Сотрудник
			|ПОМЕСТИТЬ ВТСотрудникиДляПечатиТрудовыхДоговоров
			|ИЗ
			|	Справочник.Сотрудники КАК Сотрудники
			|ГДЕ
			|	Сотрудники.Ссылка В(&МассивОбъектов)";
		
		Запрос.Выполнить();
		
		Описатель = ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
			Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиДляПечатиТрудовыхДоговоров");
		
		Описатель.ИмяВТКадровыеДанныеСотрудников = "ВТСотрудникиСДаннымиОПриеме";
		
		Если ИспользоватьКадровыйУчет Тогда
			КадровыеДанныеПриема = "ДатаПриема,ПриказОПриеме";
		Иначе
			КадровыеДанныеПриема = "ДатаПриема";
		КонецЕсли;
		
		СоздатьВТКадровыеДанныеСотрудников(Описатель, Истина, КадровыеДанныеПриема);
		
		Если ИспользоватьКадровыйУчет Тогда
			
			Запрос.Текст =
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	СотрудникиСДаннымиОПриеме.ПриказОПриеме
				|ИЗ
				|	ВТСотрудникиСДаннымиОПриеме КАК СотрудникиСДаннымиОПриеме
				|ГДЕ
				|	ЕСТЬNULL(СотрудникиСДаннымиОПриеме.ПриказОПриеме, ЗНАЧЕНИЕ(Документ.ПриемНаРаботу.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Документ.ПриемНаРаботу.ПустаяСсылка)";
			
			МассивПриказовОПриеме = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПриказОПриеме");
			
		КонецЕсли;
		
	Иначе
		МассивПриказовОПриеме = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(МассивОбъектов);
	КонецЕсли;
	
	Если ИспользоватьКадровыйУчет Тогда
		
		//Для каждого ТекПриказ из МассивПриказовОПриеме цикл
		//	Сообщить(ТекПриказ);
		//КонецЦикла;
		
		СоздатьВТДанныеДокументовПриемНаРаботу(Запрос.МенеджерВременныхТаблиц, МассивПриказовОПриеме);
		Если ВыводПоСсылкеНаСотрудника Тогда
			
			Запрос.Текст =
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ПриказыОПриеме.Ссылка КАК Ссылка,
				|	СотрудникиСДаннымиОПриеме.Сотрудник КАК Сотрудник,
				|	СотрудникиСДаннымиОПриеме.ДатаПриема КАК Период,
				|	СотрудникиСДаннымиОПриеме.ДатаПриема КАК Дата,
				|	ПриказыОПриеме.ДлительностьИспытательногоСрока КАК ДлительностьИспытательногоСрока,
				|	ПриказыОПриеме.РазрешениеНаРаботу КАК РазрешениеНаРаботу,
				|	ПриказыОПриеме.РазрешениеНаПроживание КАК РазрешениеНаПроживание,
				|	ПриказыОПриеме.УсловияОказанияМедпомощи КАК УсловияОказанияМедпомощи,
				|	ПриказыОПриеме.Руководитель КАК Руководитель,
				|	ПриказыОПриеме.ДолжностьРуководителя КАК ДолжностьРуководителя,
				|	ПриказыОПриеме.КоличествоСтавок КАК КоличествоСтавок,
				|	ПриказыОПриеме.ТрудовойДоговорДата КАК ТрудовойДоговорДата,
				|	ПриказыОПриеме.ТрудовойДоговорНомер КАК ТрудовойДоговорНомер
				|ПОМЕСТИТЬ ВТДанныеПриказовОПриеме
				|ИЗ
				|	ВТДанныеДокументов КАК ПриказыОПриеме
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиСДаннымиОПриеме КАК СотрудникиСДаннымиОПриеме
				|		ПО ПриказыОПриеме.Ссылка = СотрудникиСДаннымиОПриеме.ПриказОПриеме
				|			И ПриказыОПриеме.Сотрудник = СотрудникиСДаннымиОПриеме.Сотрудник";
			
			Запрос.Выполнить();
			
		Иначе
			
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	ПриказыОПриеме.Сотрудник,
				|	ПриказыОПриеме.Дата КАК ДатаПриема,
				|	ПриказыОПриеме.Ссылка КАК ПриказОПриеме
				|ПОМЕСТИТЬ ВТСотрудникиСДаннымиОПриеме
				|ИЗ
				|	ВТДанныеДокументов КАК ПриказыОПриеме
				|ГДЕ
				|	ПриказыОПриеме.Ссылка В(&МассивОбъектов)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	ПриказыОПриеме.Ссылка,
				|	ПриказыОПриеме.Сотрудник,
				|	ПриказыОПриеме.Дата КАК Период,
				|	ПриказыОПриеме.Дата,
				|	ПриказыОПриеме.ДлительностьИспытательногоСрока,
				|	ПриказыОПриеме.КоличествоСтавок,
				|	ПриказыОПриеме.РазрешениеНаРаботу,
				|	ПриказыОПриеме.РазрешениеНаПроживание,
				|	ПриказыОПриеме.УсловияОказанияМедпомощи,
				|	ПриказыОПриеме.Руководитель,
				|	ПриказыОПриеме.ДолжностьРуководителя,
				|	ПриказыОПриеме.ТрудовойДоговорДата КАК ТрудовойДоговорДата,
				|	ПриказыОПриеме.ТрудовойДоговорНомер КАК ТрудовойДоговорНомер
				|ПОМЕСТИТЬ ВТДанныеПриказовОПриеме
				|ИЗ
				|	ВТДанныеДокументов КАК ПриказыОПриеме
				|ГДЕ
				|	ПриказыОПриеме.Ссылка В(&МассивОбъектов)";
			
			Запрос.Выполнить();
		
		КонецЕсли;
		
	Иначе
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СотрудникиСДаннымиОПриеме.Сотрудник КАК Ссылка,
			|	СотрудникиСДаннымиОПриеме.Сотрудник,
			|	СотрудникиСДаннымиОПриеме.ДатаПриема КАК Период,
			|	СотрудникиСДаннымиОПриеме.ДатаПриема КАК Дата,
			|	0 КАК ДлительностьИспытательногоСрока,
			|	0 КАК КоличествоСтавок,
			|	NULL КАК РазрешениеНаРаботу,
			|	NULL КАК РазрешениеНаПроживание,
			|	NULL КАК УсловияОказанияМедпомощи,
			|	NULL КАК Руководитель,
			|	NULL КАК ДолжностьРуководителя,
			|	NULL КАК ТрудовойДоговорДата,
			|	NULL КАК ТрудовойДоговорНомер
			|ПОМЕСТИТЬ ВТДанныеПриказовОПриеме
			|ИЗ
			|	ВТСотрудникиСДаннымиОПриеме КАК СотрудникиСДаннымиОПриеме";
		
		Запрос.Выполнить();
		
	КонецЕсли;
	
	ЗарплатаКадры.СоздатьВТФИООтветственныхЛиц(Запрос.МенеджерВременныхТаблиц, Истина, "Руководитель", "ВТДанныеПриказовОПриеме");
	
	СоздатьВТКадровыеДанныеТрудовогоДоговора(Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиСДаннымиОПриеме", "Сотрудник,ДатаПриема");
	
	НачисленияСотрудников = Новый Соответствие;
	Если ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПлановыеНачисления) Тогда
		
		ЗапросНачислений = ЗапросВТПлановыеНачисленияСотрудников(Истина, "ВТПлановыеНачисления", "ВТКадровыеДанныеСотрудников");
		ЗапросНачислений.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
		ЗапросНачислений.Выполнить();
		
		КатегорииСдельнойОплатыТруда = РасчетЗарплаты.КатегорииСдельнойОплатыТруда();
		ЗапросНачислений.УстановитьПараметр("КатегорииСдельнойОплатыТруда", КатегорииСдельнойОплатыТруда);
		
		КатегорииКомпенсаций = РасчетЗарплаты.КатегорииНачисленийКомпенсационныхВыплат();
		ЗапросНачислений.УстановитьПараметр("КатегорииКомпенсаций", КатегорииКомпенсаций);
		
		ЗапросНачислений.Текст =
			"ВЫБРАТЬ
			|	ПлановыеНачисления.Период КАК Период,
			|	ПлановыеНачисления.Сотрудник КАК Сотрудник,
			|	ПлановыеНачисления.Начисление,
			|	ПлановыеНачисления.ОсновнойПоказатель,
			|	ПлановыеНачисления.ЗначениеОсновногоПоказателя,
			|	ПлановыеНачисления.Размер,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ПлановыеНачисления.НачислениеТарифнойСтавки, ЛОЖЬ) = ИСТИНА
			|				И НЕ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (&КатегорииСдельнойОплатыТруда)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ЭтоТарифнаяСтавка,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ПлановыеНачисления.НачислениеТарифнойСтавки, ЛОЖЬ) = ИСТИНА
			|				И НЕ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (&КатегорииСдельнойОплатыТруда)
			|			ТОГДА ЛОЖЬ
			|		КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (&КатегорииСдельнойОплатыТруда)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ЭтоСдельнаяОплатаТруда,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ПлановыеНачисления.НачислениеТарифнойСтавки, ЛОЖЬ) = ИСТИНА
			|				И НЕ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (&КатегорииСдельнойОплатыТруда)
			|			ТОГДА ЛОЖЬ
			|		КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (&КатегорииСдельнойОплатыТруда)
			|			ТОГДА ЛОЖЬ
			|		КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (&КатегорииКомпенсаций)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ЭтоКомпенсация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ПлановыеНачисления.НачислениеТарифнойСтавки, ЛОЖЬ) = ИСТИНА
			|				И НЕ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (&КатегорииСдельнойОплатыТруда)
			|			ТОГДА ЛОЖЬ
			|		КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (&КатегорииСдельнойОплатыТруда)
			|			ТОГДА ЛОЖЬ
			|		КОГДА Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (&КатегорииКомпенсаций)
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ КАК ЭтоНадбавка
			|ИЗ
			|	ВТПлановыеНачисления КАК ПлановыеНачисления
			|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК Начисления
			|		ПО ПлановыеНачисления.Начисление = Начисления.Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период,
			|	Сотрудник,
			|	Начисления.РеквизитДопУпорядочивания";
		
		УстановитьДанныеТарифнойСтавки = Истина;
		
		ВыборкаНачислений = ЗапросНачислений.Выполнить().Выбрать();
		Пока ВыборкаНачислений.Следующий() Цикл
			
			Периоды = НачисленияСотрудников.Получить(ВыборкаНачислений.Период);
			Если Периоды = Неопределено Тогда
				Периоды = Новый Соответствие;
				НачисленияСотрудников.Вставить(ВыборкаНачислений.Период, Периоды);
			КонецЕсли;
			
			ОписаниеНачислений = Периоды.Получить(ВыборкаНачислений.Сотрудник);
			Если ОписаниеНачислений = Неопределено Тогда
				
				УстановитьДанныеТарифнойСтавки = Истина;
				
				ОписаниеНачислений = Новый Структура;
				ОписаниеНачислений.Вставить("ТарифнаяСтавка", Новый Структура("Начисление,ОсновнойПоказатель,ЗначениеОсновногоПоказателя,Размер"));
				ОписаниеНачислений.Вставить("СдельнаяОплатаТруда", Новый Структура("Начисление,Размер"));
				ОписаниеНачислений.Вставить("Компенсации", Новый Массив);
				ОписаниеНачислений.Вставить("Надбавки", Новый Массив);
				
				Периоды.Вставить(ВыборкаНачислений.Сотрудник, ОписаниеНачислений);
				
			КонецЕсли;
			
			Если УстановитьДанныеТарифнойСтавки И ВыборкаНачислений.ЭтоТарифнаяСтавка Тогда
				
				ЗаполнитьЗначенияСвойств(ОписаниеНачислений.ТарифнаяСтавка, ВыборкаНачислений);
				УстановитьДанныеТарифнойСтавки = Ложь;
				
			ИначеЕсли УстановитьДанныеТарифнойСтавки И ВыборкаНачислений.ЭтоСдельнаяОплатаТруда Тогда
				
				ЗаполнитьЗначенияСвойств(ОписаниеНачислений.СдельнаяОплатаТруда, ВыборкаНачислений);
				УстановитьДанныеТарифнойСтавки = Ложь;
				
			Иначе
				
				ОписаниеНачисления = Новый Структура("Начисление,Размер");
				ЗаполнитьЗначенияСвойств(ОписаниеНачисления, ВыборкаНачислений);
				
				Если ВыборкаНачислений.ЭтоКомпенсация Тогда
					ОписаниеНачислений.Компенсации.Добавить(ОписаниеНачисления);
				Иначе
					ОписаниеНачислений.Надбавки.Добавить(ОписаниеНачисления);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КадровыеДанные.Сотрудник
		|ИЗ
		|	ВТКадровыеДанныеСотрудников КАК КадровыеДанные
		|ГДЕ
		|	ЕСТЬNULL(КадровыеДанные.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Сотрудник %1 не принят на работу'"),
			Выборка.Сотрудник);
		
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КадровыеДанные.Организация,
		|	КадровыеДанные.Период
		|ИЗ
		|	ВТКадровыеДанныеСотрудников КАК КадровыеДанные";
	
	СведенияОбОрганизациях = Новый ТаблицаЗначений;
	СведенияОбОрганизациях.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	СведенияОбОрганизациях.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	СведенияОбОрганизациях.Колонки.Добавить("НаименованиеПолное", Новый ОписаниеТипов("Строка"));
	СведенияОбОрганизациях.Колонки.Добавить("ИНН", Новый ОписаниеТипов("Строка"));
	СведенияОбОрганизациях.Колонки.Добавить("КПП", Новый ОписаниеТипов("Строка"));
	СведенияОбОрганизациях.Колонки.Добавить("ТелефонОрганизации", Новый ОписаниеТипов("Строка"));
	СведенияОбОрганизациях.Колонки.Добавить("ФаксОрганизации", Новый ОписаниеТипов("Строка"));
	СведенияОбОрганизациях.Колонки.Добавить("АдресЮридический", Новый ОписаниеТипов("Строка"));
	СведенияОбОрганизациях.Колонки.Добавить("АдресФактический", Новый ОписаниеТипов("Строка"));
	СведенияОбОрганизациях.Колонки.Добавить("ОрганизацияГородФактическогоАдреса", Новый ОписаниеТипов("Строка"));
	
	РезультатЗапросаПоШапке = Запрос.Выполнить();
	
	ТаблицаРезультатЗапросаПоШапке = РезультатЗапросаПоШапке.Выгрузить().ВыгрузитьКолонку("Организация");
	
	//Сообщить(ТаблицаРезультатЗапросаПоШапке.Количество());
	//Для каждого СтрокаПоШапке из ТаблицаРезультатЗапросаПоШапке цикл
	//	Сообщить(СтрокаПоШапке);
	//КонецЦикла;
	
	//АдресаОрганизаций = УправлениеКонтактнойИнформациейЗарплатаКадры.АдресаОрганизаций(РезультатЗапросаПоШапке.Выгрузить().ВыгрузитьКолонку("Организация"));
	АдресаОрганизаций = УправлениеКонтактнойИнформациейЗарплатаКадры.АдресаОрганизаций(ТаблицаРезультатЗапросаПоШапке);
	
	Выборка = РезультатЗапросаПоШапке.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрокаСведенияОбОрганизациях = СведенияОбОрганизациях.Добавить();
		
		Сведения = Новый СписокЗначений;
		Сведения.Добавить("", "НаимЮЛПол");
		Сведения.Добавить("", "ИННЮЛ");
		Сведения.Добавить("", "КППЮЛ");
		Сведения.Добавить("", "ТелОрганизации");
		Сведения.Добавить("", "ФаксОрганизации");
		
		УстановитьПривилегированныйРежим(Истина);
		ОргСведения = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(Выборка.Организация, Выборка.Период, Сведения);
		УстановитьПривилегированныйРежим(Ложь);
		
		НоваяСтрокаСведенияОбОрганизациях.Организация = Выборка.Организация;
		НоваяСтрокаСведенияОбОрганизациях.Период = Выборка.Период;
		
		Если ОргСведения.Свойство("НаимЮЛПол") Тогда
			НоваяСтрокаСведенияОбОрганизациях.НаименованиеПолное = ОргСведения.НаимЮЛПол;
		КонецЕсли;
		
		Если ОргСведения.Свойство("ИННЮЛ") Тогда
			НоваяСтрокаСведенияОбОрганизациях.ИНН = ОргСведения.ИННЮЛ;
		КонецЕсли;
		
		Если ОргСведения.Свойство("КППЮЛ") Тогда
			НоваяСтрокаСведенияОбОрганизациях.КПП = ОргСведения.КППЮЛ;
		КонецЕсли;
		
		Если ОргСведения.Свойство("ТелОрганизации") Тогда
			НоваяСтрокаСведенияОбОрганизациях.ТелефонОрганизации = ОргСведения.ТелОрганизации;
		КонецЕсли;
		
		Если ОргСведения.Свойство("ФаксОрганизации") Тогда
			НоваяСтрокаСведенияОбОрганизациях.ФаксОрганизации = ОргСведения.ФаксОрганизации;
		КонецЕсли;
		
		ОписаниеЮридическогоАдреса = УправлениеКонтактнойИнформациейЗарплатаКадры.АдресОрганизации(
			АдресаОрганизаций,
			Выборка.Организация,
			Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
		//Сообщить("Представление юр.адреса");
		НоваяСтрокаСведенияОбОрганизациях.АдресЮридический = ОписаниеЮридическогоАдреса.Представление;
		
		ОписаниеФактическогоАдреса = УправлениеКонтактнойИнформациейЗарплатаКадры.АдресОрганизации(
			АдресаОрганизаций,
			Выборка.Организация,
			Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
		//Сообщить("Представление фактического адреса");
		НоваяСтрокаСведенияОбОрганизациях.АдресФактический = ОписаниеФактическогоАдреса.Представление;
		НоваяСтрокаСведенияОбОрганизациях.ОрганизацияГородФактическогоАдреса = ОписаниеФактическогоАдреса.Город;
		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СведенияОбОрганизациях", СведенияОбОрганизациях);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОбОрганизациях.Период КАК Период,
		|	СведенияОбОрганизациях.Организация КАК Организация,
		|	СведенияОбОрганизациях.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	СведенияОбОрганизациях.ИНН КАК ИНН,
		|	СведенияОбОрганизациях.КПП КАК КПП,
		|	СведенияОбОрганизациях.ТелефонОрганизации КАК ТелефонОрганизации,
		|	СведенияОбОрганизациях.ФаксОрганизации КАК ФаксОрганизации,
		|	СведенияОбОрганизациях.АдресЮридический КАК ОрганизацияАдресЮридический,
		|	СведенияОбОрганизациях.АдресФактический КАК ОрганизацияАдресФактический,
		|	СведенияОбОрганизациях.ОрганизацияГородФактическогоАдреса КАК ОрганизацияГородФактическогоАдреса
		|ПОМЕСТИТЬ ВТДанныеОрганизаций
		|ИЗ
		|	&СведенияОбОрганизациях КАК СведенияОбОрганизациях
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СотрудникиСДаннымиОПриеме.Сотрудник КАК Ссылка,
		|	СотрудникиСДаннымиОПриеме.Сотрудник КАК Сотрудник,
		|	СотрудникиСДаннымиОПриеме.ДатаПриема КАК ДатаПриема,
		|	КадровыеДанныеСотрудников.Подразделение КАК Подразделение,
		|	КадровыеДанныеСотрудников.Должность КАК Должность,
		|	КадровыеДанныеСотрудников.ВидЗанятости КАК ВидЗанятости,
		|	ДанныеОрганизаций.Организация КАК Организация,
		|	ДанныеОрганизаций.ОрганизацияНаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	ДанныеОрганизаций.ИНН КАК ИНН,
		|	ДанныеОрганизаций.КПП КАК КПП,
		|	ДанныеОрганизаций.ТелефонОрганизации КАК ТелефонОрганизации,
		|	ДанныеОрганизаций.ФаксОрганизации КАК ФаксОрганизации,
		|	ДанныеОрганизаций.ОрганизацияАдресЮридический КАК ОрганизацияАдресЮридический,
		|	ДанныеОрганизаций.ОрганизацияАдресФактический КАК ОрганизацияАдресФактический,
		|	ДанныеОрганизаций.ОрганизацияГородФактическогоАдреса КАК ОрганизацияГородФактическогоАдреса,
		|	Организации.НаименованиеСокращенное КАК ОрганизацияНаименованиеСокращенное,
		|	КадровыеДанныеСотрудников.Период КАК Период,
		|	КадровыеДанныеСотрудников.Страна КАК Страна,
		|	КадровыеДанныеСотрудников.ФИОПолные КАК СотрудникФИОПолные,
		|	КадровыеДанныеСотрудников.АдресМестаПроживанияПредставление КАК СотрудникАдресМестаПроживания,
		|	КадровыеДанныеСотрудников.ДокументПредставление КАК СотрудникУдостоверениеЛичности,
		|	КадровыеДанныеСотрудников.СтраховойНомерПФР КАК СотрудникСНИЛС,
		|	КадровыеДанныеСотрудников.КлассУсловийТруда КАК УсловияТрудаНаРабочемМесте,
		|	ЕСТЬNULL(КадровыеДанныеСотрудников.ДатаДоговораКонтракта, ДанныеПриказовОПриеме.ТрудовойДоговорДата) КАК ТрудовойДоговорДата,
		|	ЕСТЬNULL(КадровыеДанныеСотрудников.НомерДоговораКонтракта, ДанныеПриказовОПриеме.ТрудовойДоговорНомер) КАК ТрудовойДоговорНомер,
		|	КадровыеДанныеСотрудников.ДатаОкончания КАК ДатаЗавершенияТрудовогоДоговора,
		|	КадровыеДанныеСотрудников.ОснованиеСрочногоДоговора КАК ОснованиеСрочногоДоговора,
		|	КадровыеДанныеСотрудников.ДлительностьРабочейНедели КАК ДлительностьРабочейНедели,
		|	КадровыеДанныеСотрудников.ОписаниеДлительностиРабочейНеделиВДнях КАК ОписаниеДлительностиРабочейНеделиВДнях,
		|	КадровыеДанныеСотрудников.ПродолжительностьРабочегоДня КАК ПродолжительностьРабочегоДня,
		|	КадровыеДанныеСотрудников.СокращеннаяРабочаяНеделя КАК СокращеннаяРабочаяНеделя,
		|	КадровыеДанныеСотрудников.НеполноеРабочееВремя КАК НеполноеРабочееВремя,
		|	КадровыеДанныеСотрудников.КоличествоДнейОсновногоОтпуска КАК ДлительностьОсновногоОтпуска,
		|	КадровыеДанныеСотрудников.КоличествоДнейОтпускаЗаВредность КАК ДлительностьВредногоОтпуска,
		|	КадровыеДанныеСотрудников.КоличествоДнейСеверногоОтпуска КАК ДлительностьСеверногоОтпуска,
		|	КадровыеДанныеСотрудников.ОснованиеПредставителя КАК ОснованиеРуководителяВРодительномПадеже,
		|	КадровыеДанныеСотрудников.EMailПредставление КАК EMail,
		|	ДанныеПриказовОПриеме.ДлительностьИспытательногоСрока КАК ДлительностьИспытательногоСрока,
		|	ДанныеПриказовОПриеме.РазрешениеНаРаботу КАК РазрешениеНаРаботу,
		|	ДанныеПриказовОПриеме.РазрешениеНаПроживание КАК РазрешениеНаПроживание,
		|	ДанныеПриказовОПриеме.УсловияОказанияМедпомощи КАК УсловияОказанияМедпомощи,
		|	ДанныеПриказовОПриеме.ДолжностьРуководителя КАК РуководительДолжность,
		|	ФИОРуководителя.ФИОПолные КАК РуководительФИОПолные,
		|	ФИОРуководителя.Пол КАК РуководительПол,
		|	ДанныеПриказовОПриеме.КоличествоСтавок КАК КоличествоСтавок
		|ИЗ
		|	ВТСотрудникиСДаннымиОПриеме КАК СотрудникиСДаннымиОПриеме
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеПриказовОПриеме КАК ДанныеПриказовОПриеме
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИОРуководителя
		|			ПО ДанныеПриказовОПриеме.Дата = ФИОРуководителя.Дата
		|				И ДанныеПриказовОПриеме.Руководитель = ФИОРуководителя.ФизическоеЛицо
		|		ПО СотрудникиСДаннымиОПриеме.ДатаПриема = ДанныеПриказовОПриеме.Дата
		|			И СотрудникиСДаннымиОПриеме.Сотрудник = ДанныеПриказовОПриеме.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеТрудовогоДоговора КАК КадровыеДанныеСотрудников
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОрганизаций КАК ДанныеОрганизаций
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|				ПО ДанныеОрганизаций.Организация = Организации.Ссылка
		|			ПО КадровыеДанныеСотрудников.Организация = ДанныеОрганизаций.Организация
		|				И КадровыеДанныеСотрудников.Период = ДанныеОрганизаций.Период
		|		ПО СотрудникиСДаннымиОПриеме.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
		|			И СотрудникиСДаннымиОПриеме.ДатаПриема = КадровыеДанныеСотрудников.Период";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеДоговора = ПараметрыТрудовогоДоговора(ДистанционныеРаботы, ДоговорСНадомником);
		
		ИсключаемыеИЗЗаполненияКолонки =
			"ДатаПриема,
			|ТрудовойДоговорДата,
			|ВидЗанятости,
			|ОрганизацияНаименованиеСокращенное,
			|ДатаЗавершенияТрудовогоДоговора,
			|ОснованиеСрочногоДоговора,
			|ДлительностьРабочейНедели,
			|ОписаниеДлительностиРабочейНеделиВДнях,
			|ПродолжительностьРабочегоДня";
		
		ЗаполнитьЗначенияСвойств(ДанныеДоговора, Выборка, , ИсключаемыеИЗЗаполненияКолонки);
		
		//scoms ФИО и Паспортные данные берем последние (ДатаДокумента)
		ДанныеДоговора.СотрудникФИОПолные = ДанныеДоговора.Ссылка.ФизическоеЛицо.ФИО;
		
		ЗапросУдостоверениеЛичности = Новый Запрос;
		ЗапросУдостоверениеЛичности.Текст = "ВЫБРАТЬ
		|	ДокументыФизическихЛицСрезПоследних.Физлицо КАК Физлицо,
		|	ДокументыФизическихЛицСрезПоследних.Представление КАК Представление
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(&Период, ) КАК ДокументыФизическихЛицСрезПоследних
		|ГДЕ
		|	ДокументыФизическихЛицСрезПоследних.Физлицо = &Физлицо";
		ЗапросУдостоверениеЛичности.УстановитьПараметр("Физлицо", ДанныеДоговора.Ссылка.ФизическоеЛицо);
		ЗапросУдостоверениеЛичности.УстановитьПараметр("Период", Выборка.ДатаПриема);
		
		РезультатУдостоверениеЛичности = ЗапросУдостоверениеЛичности.Выполнить().Выбрать();
		
		Если РезультатУдостоверениеЛичности.Следующий() Тогда
			ДанныеДоговора.СотрудникУдостоверениеЛичности = РезультатУдостоверениеЛичности.Представление;	
		КонецЕсли;//scoms
		
		Если ЗначениеЗаполнено(Выборка.ТрудовойДоговорДата) Тогда
			ДанныеДоговора.ТрудовойДоговорДата = Формат(Выборка.ТрудовойДоговорДата, "ДЛФ=DD");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ДатаЗавершенияТрудовогоДоговора) Тогда
			
			ДанныеДоговора.СрочностьТрудовогоДоговора = НСтр("ru='срочный трудовой договор'");
			ДанныеДоговора.ДатаЗавершенияТрудовогоДоговора = Формат(Выборка.ДатаЗавершенияТрудовогоДоговора, "ДЛФ=DD");
			
			ДанныеДоговора.ОснованиеСрочногоДоговора = Выборка.ОснованиеСрочногоДоговора;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ДатаПриема) Тогда	
			ДанныеДоговора.ДатаПриема = Формат(Выборка.ДатаПриема, "ДЛФ=DD");
		Иначе
			ДанныеДоговора.ДатаПриема = Выборка.ТрудовойДоговорДата;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ВидЗанятости) Тогда
			
			Если Выборка.ВидЗанятости = Перечисления.ВидыЗанятости.ОсновноеМестоРаботы Тогда
				ДанныеДоговора.ВидЗанятости = НСтр("ru='основным видом работы'");
			Иначе
				ДанныеДоговора.ВидЗанятости = НСтр("ru='работой по совместительству'");
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.УсловияТрудаНаРабочемМесте) Тогда
			ДанныеДоговора.УсловияТрудаНаРабочемМесте = Выборка.УсловияТрудаНаРабочемМесте;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ДлительностьРабочейНедели) Тогда
			
			ДанныеДоговора.ДлительностьРабочейНедели =
				ЧислоПрописью(Выборка.ДлительностьРабочейНедели, "Л = ru_RU", НСтр("ru='час,часа,часов,м,,,,,0'"))
				+ " " + НСтр("ru='в неделю'");
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ОписаниеДлительностиРабочейНеделиВДнях)
			Или Выборка.ОписаниеДлительностиРабочейНеделиВДнях = 0 Тогда
			
			Если Выборка.ОписаниеДлительностиРабочейНеделиВДнях = 5 Тогда
				ДанныеДоговора.ОписаниеДлительностиРабочейНеделиВДнях = НСтр("ru='пятидневная с двумя выходными днями'");
			ИначеЕсли Выборка.ОписаниеДлительностиРабочейНеделиВДнях = 6 Тогда
				ДанныеДоговора.ОписаниеДлительностиРабочейНеделиВДнях = НСтр("ru='шестидневная с одним выходными днем'");
			ИначеЕсли Выборка.СокращеннаяРабочаяНеделя = Истина Тогда
				ДанныеДоговора.ОписаниеДлительностиРабочейНеделиВДнях = НСтр("ru='неполная рабочая неделя'");
			ИначеЕсли Выборка.НеполноеРабочееВремя = Истина Тогда
				ДанныеДоговора.ОписаниеДлительностиРабочейНеделиВДнях = НСтр("ru='сокращенное рабочее время'");
			Иначе
				ДанныеДоговора.ОписаниеДлительностиРабочейНеделиВДнях = НСтр("ru='рабочая неделя с предоставлением выходных дней по скользящему графику'");
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ПродолжительностьРабочегоДня) Тогда
			ДанныеДоговора.ПродолжительностьРабочегоДня = Выборка.ПродолжительностьРабочегоДня;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ОрганизацияНаименованиеСокращенное) Тогда
			//ДанныеДоговора.ОрганизацияНаименованиеСокращенное = ", " + Выборка.ОрганизацияНаименованиеСокращенное;
			ДанныеДоговора.ОрганизацияНаименованиеСокращенное = Выборка.ОрганизацияНаименованиеСокращенное;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ИНН) Тогда
			
			ДанныеДоговора.ОрганизацияИННКПП = Выборка.ИНН;
			ДанныеДоговора.ОрганизацияИНН = Выборка.ИНН;
			
			Если ЗначениеЗаполнено(Выборка.КПП) Тогда
				ДанныеДоговора.ОрганизацияИННКПП = ДанныеДоговора.ОрганизацияИННКПП + " / " + Выборка.КПП;
				ДанныеДоговора.ОрганизацияКПП = Выборка.КПП;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ОснованиеРуководителяВРодительномПадеже) Тогда
			ДанныеДоговора.ОснованиеРуководителяВРодительномПадеже = Выборка.ОснованиеРуководителяВРодительномПадеже;
		КонецЕсли;
		
		//scoms руководитель на ДатуДокумента                                                                                                             
		ТекущийРуководитель = СведенияОбОтветственныхЛицах.СведенияОбОтветственныхЛицах(Выборка.Организация, "Руководитель,ДолжностьРуководителя", СтруктураДат);
		                                                                                                                                                
		Если ЗначениеЗаполнено(ТекущийРуководитель.Руководитель.Наименование) Тогда
			
			РезультатСклонения = "";
			Если ФизическиеЛицаЗарплатаКадры.Просклонять(ТекущийРуководитель.Руководитель.Наименование, 2, РезультатСклонения, ТекущийРуководитель.Руководитель.Пол) Тогда
				ДанныеДоговора.РуководительФИОПолныеВРодительномПадеже = РезультатСклонения;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ДлительностьИспытательногоСрока) Тогда
			
			ДанныеДоговора.ИспытательныйСрок = НСтр("ru='устанавливается'");
			ДанныеДоговора.ИспытательныйСрокМесяцев = Выборка.ДлительностьИспытательногоСрока;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.РазрешениеНаПроживание) Тогда
			ДанныеДоговора.ИныеДокументыПредставляемыеИностраннымиГражданами = Выборка.РазрешениеНаПроживание
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.РазрешениеНаРаботу) Тогда
			
			Если ЗначениеЗаполнено(ДанныеДоговора.ИныеДокументыПредставляемыеИностраннымиГражданами) Тогда
				
				ДанныеДоговора.ИныеДокументыПредставляемыеИностраннымиГражданами =
					ДанныеДоговора.ИныеДокументыПредставляемыеИностраннымиГражданами + ";" + Символы.ПС;
				
			КонецЕсли;
			
			ДанныеДоговора.ИныеДокументыПредставляемыеИностраннымиГражданами =
				ДанныеДоговора.ИныеДокументыПредставляемыеИностраннымиГражданами
				+ Выборка.РазрешениеНаРаботу;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущийРуководитель.ДолжностьРуководителя) Тогда
			
			ДанныеДоговора.РуководительДолжностьВРодительномПадеже =
				СклонениеПредставленийОбъектов.ПросклонятьПредставление(ТекущийРуководитель.ДолжностьРуководителя.Наименование, 2, ТекущийРуководитель.ДолжностьРуководителя);
			
		КонецЕсли;
		
		Периоды = НачисленияСотрудников.Получить(Выборка.Период);
		Если Периоды <> Неопределено Тогда
			
			ОписанияНачислений = Периоды.Получить(Выборка.Сотрудник);
			Если ОписанияНачислений <> Неопределено Тогда
				
				Если ЗначениеЗаполнено(ОписанияНачислений.ТарифнаяСтавка.Начисление) Тогда
					ДанныеДоговора.ТарифнаяСтавка = ПредставлениеТарифнойСтавкиДоговоровМикропредприятий(ОписанияНачислений.ТарифнаяСтавка);
					ДанныеДоговора.ТарифнаяСтавкаРазмер = ОписанияНачислений.ТарифнаяСтавка.Размер;
				ИначеЕсли ЗначениеЗаполнено(ОписанияНачислений.СдельнаяОплатаТруда.Начисление) Тогда
					
					ДанныеДоговора.СдельнаяОплатаТруда = Строка(ОписанияНачислений.СдельнаяОплатаТруда.Начисление);
					Если ЗначениеЗаполнено(ОписанияНачислений.СдельнаяОплатаТруда.Размер) Тогда
						ДанныеДоговора.СдельнаяОплатаТруда = ДанныеДоговора.СдельнаяОплатаТруда + " " + Формат(ОписанияНачислений.СдельнаяОплатаТруда.Размер, "ЧДЦ=2");
					КонецЕсли;
					
				КонецЕсли;
				
				ДанныеДоговора.КомпенсационныеВыплаты = ОписанияНачислений.Компенсации;
				ДанныеДоговора.СтимулирующиеВыплаты = ОписанияНачислений.Надбавки;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ДанныеТрудовыхДоговоров.Добавить(ДанныеДоговора);
		
	КонецЦикла;
	
	Возврат ДанныеТрудовыхДоговоров;
	
КонецФункции

// Возвращает структуру с параметрами для метода СоздатьВТКадровыеДанныеСотрудников.
//
// Параметры:
//		МенеджерВременныхТаблиц
//		ИмяВременнойТаблицыОтборовСотрудников - имя временной таблицы - "фильтра".
//		ИменаПолейВременнойТаблицыОтборовСотрудников - строка с именами полей отбора
//							сотрудников ",". Строка должна содержать два имени поля, разделенные
//							запятой. Первое имя соответствует полю "Сотрудник", второе полю "Период".
//
// Возвращаемое значение:
//		Структура с полями:
//			МенеджерВременныхТаблиц
//			ИмяВременнойТаблицыОтборовСотрудников - имя временной таблицы отборов сотрудников.
//			ПоляОтбораСотрудников - см. ПоляОтбораСотрудников.
//
&НаСервере
Функция ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(МенеджерВременныхТаблиц, ИмяВременнойТаблицыОтборовСотрудников, ИменаПолейВременнойТаблицыОтборовСотрудников = "Сотрудник,Период") Экспорт
	
	ОписательВременныхТаблиц = Новый Структура;
	
	ОписательВременныхТаблиц.Вставить("МенеджерВременныхТаблиц", МенеджерВременныхТаблиц);
	ОписательВременныхТаблиц.Вставить("ИмяВременнойТаблицыОтборовСотрудников", ИмяВременнойТаблицыОтборовСотрудников);
	ОписательВременныхТаблиц.Вставить("ПоляОтбораСотрудников", ПоляОтбораСотрудников(ИменаПолейВременнойТаблицыОтборовСотрудников));
	ОписательВременныхТаблиц.Вставить("ИмяВТКадровыеДанныеСотрудников", "ВТКадровыеДанныеСотрудников");
	ОписательВременныхТаблиц.Вставить("ИмяВременнойТаблицыОтборовРазличныхСотрудников", "");
	
	ДополнитьСтруктуруПараметровИменамиТаблицСКадровойИсториейСотрудников(ОписательВременныхТаблиц);
	
	Возврат ОписательВременныхТаблиц;
	
КонецФункции

// Формирует временную таблицу ВТКадровыеДанныеСотрудников, список сотрудников и периодов,
// по которым необходимо получить данные, берутся из временной таблицы в менеджере временных
// таблиц, переданном в качестве параметра. Временная таблица обязательно должна содержать
// колонки Сотрудник и Период.
//
// Параметры:
//		ОписательВременныхТаблиц - структура, сформированная 
//				методом ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников.
//		ТолькоРазрешенные - Булево
//		КадровыеДанные - см. описание к функции КадровыеДанныеСотрудников.
//		ПоляОтбораПериодическихДанных -  см. описание к функции КадровыеДанныеСотрудников.
//
&НаСервере
Процедура СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, ТолькоРазрешенные, КадровыеДанные, ПоляОтбораПериодическихДанных = Неопределено, ФормироватьСПериодичностьДень = Истина) Экспорт
	
	ОписательВременнойТаблицыОтборов = ОписаниеВременнойТаблицыОтборовСотрудников(
		ОписательВременныхТаблиц.ИмяВременнойТаблицыОтборовСотрудников,
		ОписательВременныхТаблиц.ПоляОтбораСотрудников.Сотрудник,
		ОписательВременныхТаблиц.ПоляОтбораСотрудников.Период);
	
	ИсточникиДанных = Новый Соответствие;
	
	Запрос = ЗапросВТКадровыеДанныеСотрудников(
		ТолькоРазрешенные,
		ОписательВременнойТаблицыОтборов,
		КадровыеДанные,
		ПоляОтбораПериодическихДанных,
		ФормироватьСПериодичностьДень,
		ИсточникиДанных,
		ОписательВременныхТаблиц.ИмяВТКадровыеДанныеСотрудников);
	
	Запрос.МенеджерВременныхТаблиц = ОписательВременныхТаблиц.МенеджерВременныхТаблиц;
	
	Запрос.Выполнить();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьВТДанныеДокументовПриемНаРаботу(МенеджерВременныхТаблиц, МассивОбъектов) Экспорт
	
	СоздатьВТДанныеДокументовПриемНаРаботу_(МенеджерВременныхТаблиц, МассивОбъектов);
	
КонецПроцедуры 

&НаСервере
Процедура СоздатьВТКадровыеДанныеТрудовогоДоговора(МенеджерВременныхТаблиц, ИмяВременнойТаблицыОтборовСотрудников, ИменаПолейВременнойТаблицыОтборовСотрудников)
	
	СоздатьВТКадровыеДанныеТрудовогоДоговора_(МенеджерВременныхТаблиц, ИмяВременнойТаблицыОтборовСотрудников, ИменаПолейВременнойТаблицыОтборовСотрудников);
	
КонецПроцедуры 

&НаСервере
Функция ЗапросВТПлановыеНачисленияСотрудников(ТолькоРазрешенные, ИмяВТПлановыеНачисленияСотрудников, ИмяВременнойТаблицыОтборовСотрудников, Знач ПоляОтбораСотрудников = "Сотрудник,Период", ПоляОтбораПериодическихДанных = Неопределено, ФормироватьСПериодичностьДень = Истина) Экспорт
	
	Возврат КадровыйУчетВнутренний.ЗапросВТПлановыеНачисленияСотрудников(ТолькоРазрешенные, ИмяВТПлановыеНачисленияСотрудников, ИмяВременнойТаблицыОтборовСотрудников, ПоляОтбораСотрудников, ПоляОтбораПериодическихДанных, ФормироватьСПериодичностьДень);
	
КонецФункции 

&НаСервере
Функция ПараметрыТрудовогоДоговора(ДистанционныеРаботы = Ложь, ДоговорСНадомником = Ложь)
	
	ПараметрыДоговора = Новый Структура;
	
	ПараметрыДоговора.Вставить("Ссылка");
	
	ПараметрыДоговора.Вставить("ТрудовойДоговорНомер", "__________");
	ПараметрыДоговора.Вставить("ТрудовойДоговорДата");
	
	ПараметрыДоговора.Вставить("ТрудовойДоговорНаДистанционныеРаботы", ДистанционныеРаботы);
	ПараметрыДоговора.Вставить("ТрудовойДоговорСНадомником", ДоговорСНадомником);
	ПараметрыДоговора.Вставить("ТрудовойДоговорСИностранцем", Ложь);
	ПараметрыДоговора.Вставить("ОснованиеСрочногоДоговора");
	
	ПараметрыДоговора.Вставить("СотрудникФИОПолные");
	ПараметрыДоговора.Вставить("СотрудникАдресМестаПроживания");
	ПараметрыДоговора.Вставить("СотрудникУдостоверениеЛичности");
	ПараметрыДоговора.Вставить("СотрудникСНИЛС");
	
	ПараметрыДоговора.Вставить("УсловияОказанияМедпомощи");
	ПараметрыДоговора.Вставить("ИныеДокументыПредставляемыеИностраннымиГражданами");
	
	ПараметрыДоговора.Вставить("ДатаПриема");
	ПараметрыДоговора.Вставить("Подразделение");
	ПараметрыДоговора.Вставить("Должность");
	ПараметрыДоговора.Вставить("УсловияТрудаНаРабочемМесте");
	ПараметрыДоговора.Вставить("СрочностьТрудовогоДоговора", НСтр("ru='трудовой договор на неопределенный срок'"));
	ПараметрыДоговора.Вставить("ДатаЗавершенияТрудовогоДоговора");
	ПараметрыДоговора.Вставить("ИспытательныйСрок", НСтр("ru='не устанавливается'"));
	ПараметрыДоговора.Вставить("ИспытательныйСрокМесяцев");
	ПараметрыДоговора.Вставить("ВидЗанятости");
	ПараметрыДоговора.Вставить("МестоОпределенияДолжностныхОбязанностей", НСтр("ru='в должностной инструкции'"));
	
	ПараметрыДоговора.Вставить("ТарифнаяСтавка");
	ПараметрыДоговора.Вставить("СдельнаяОплатаТруда");
	ПараметрыДоговора.Вставить("КомпенсационныеВыплаты", Новый Массив);
	ПараметрыДоговора.Вставить("СтимулирующиеВыплаты", Новый Массив);
	
	ПараметрыДоговора.Вставить("КоличествоСтавок");
	ПараметрыДоговора.Вставить("ТарифнаяСтавкаРазмер");
	
	ПараметрыДоговора.Вставить("ДлительностьРабочейНедели", НСтр("ru='40 часов в неделю'"));
	ПараметрыДоговора.Вставить("ОписаниеДлительностиРабочейНеделиВДнях", НСтр("ru='пятидневная с двумя выходными днями'"));
	ПараметрыДоговора.Вставить("ПродолжительностьРабочегоДня", 8);
	
	ПараметрыДоговора.Вставить("ДлительностьОсновногоОтпуска", 28);
	ПараметрыДоговора.Вставить("ДлительностьВредногоОтпуска", 0);
	ПараметрыДоговора.Вставить("ДлительностьСеверногоОтпуска", 0);
	
	ПараметрыДоговора.Вставить("ОрганизацияНаименованиеПолное");
	ПараметрыДоговора.Вставить("ОрганизацияНаименованиеСокращенное");
	ПараметрыДоговора.Вставить("ОрганизацияГородФактическогоАдреса");
	ПараметрыДоговора.Вставить("ОрганизацияАдресЮридический");
	ПараметрыДоговора.Вставить("ОрганизацияАдресФактический");
	ПараметрыДоговора.Вставить("ОрганизацияИННКПП");
	
	ПараметрыДоговора.Вставить("ОрганизацияИНН");
	ПараметрыДоговора.Вставить("ОрганизацияКПП");
	
	ПараметрыДоговора.Вставить("РуководительДолжностьВРодительномПадеже");
	ПараметрыДоговора.Вставить("РуководительФИОПолныеВРодительномПадеже");
	ПараметрыДоговора.Вставить("ОснованиеРуководителяВРодительномПадеже", НСтр("ru='устава'"));
	
	ПараметрыДоговора.Вставить("EMail");
	
	Возврат ПараметрыДоговора;
	
КонецФункции

&НаСервере
Функция ПредставлениеТарифнойСтавкиДоговоровМикропредприятий(ОписаниеТарифнойСтавки)
			
	ПредставлениеТарифнойСтавки = "";
	
	Если ЗначениеЗаполнено(ОписаниеТарифнойСтавки.ЗначениеОсновногоПоказателя) Тогда
		
		Если ЗначениеЗаполнено(ОписаниеТарифнойСтавки.ОсновнойПоказатель) Тогда
			
			ПредставлениеТарифнойСтавки = Строка(ОписаниеТарифнойСтавки.ОсновнойПоказатель);
			РеквизитыПоказателя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОписаниеТарифнойСтавки.ОсновнойПоказатель, "Точность,ТипПоказателя,ВидТарифнойСтавки");
			
			Точность = РеквизитыПоказателя.Точность;
			Денежный = (РеквизитыПоказателя.ТипПоказателя = Перечисления.ТипыПоказателейРасчетаЗарплаты.Денежный);
			ВидТарифнойСтавки = РеквизитыПоказателя.ВидТарифнойСтавки;
			
		Иначе
			
			ПредставлениеТарифнойСтавки = Строка(ОписаниеТарифнойСтавки.Начисление);
			
			Точность = 2;
			Денежный = Истина;
			ВидТарифнойСтавки = Перечисления.ВидыТарифныхСтавок.МесячнаяТарифнаяСтавка;
			
		КонецЕсли;
		
		ПредставлениеТарифнойСтавки =
			ПредставлениеТарифнойСтавки + ": " + Формат(ОписаниеТарифнойСтавки.ЗначениеОсновногоПоказателя, "ЧДЦ=" + Точность + "; ЧГ=");
		
		Если Денежный Тогда
			
			ПредставлениеТарифнойСтавки = ПредставлениеТарифнойСтавки + " " + НСтр("ru='руб.'");
			
			Если ВидТарифнойСтавки = Перечисления.ВидыТарифныхСтавок.ЧасоваяТарифнаяСтавка Тогда
				ПредставлениеТарифнойСтавки = ПредставлениеТарифнойСтавки + " " + НСтр("ru='за час'");
			ИначеЕсли ВидТарифнойСтавки = Перечисления.ВидыТарифныхСтавок.ДневнаяТарифнаяСтавка Тогда
				ПредставлениеТарифнойСтавки = ПредставлениеТарифнойСтавки + " " + НСтр("ru='за день'");
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		ПредставлениеТарифнойСтавки = КадровыйУчетБазовый.ПредставлениеТарифнойСтавкиДоговоровМикропредприятий(ОписаниеТарифнойСтавки);
	КонецЕсли;
	
	Возврат ПредставлениеТарифнойСтавки;
	
КонецФункции

// Возвращает структуру описания полей отбора для методов получения кадровых данных сотрудников.
//
// Параметры:
//		ИменаПолейВременнойТаблицыОтборовСотрудников - строка с именами полей отбора
//							сотрудников ",". Строка должна содержать два имени поля, разделенные
//							запятой. Первое имя соответствует полю "Сотрудник", второе полю "Период".
//
// Возвращаемое значение:
//		Структура содержащая имена полей отбора сотрудников
//			 КлючиСтруктуры:
//			 	Сотрудник
//				Период
//
&НаСервере
Функция ПоляОтбораСотрудников(ИменаПолейВременнойТаблицыОтборовСотрудников = "Сотрудник,Период") Экспорт
	
	МассивИменПолейОтбораСотрудников = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИменаПолейВременнойТаблицыОтборовСотрудников, ",", , Истина);
	Возврат Новый Структура("Сотрудник,Период", МассивИменПолейОтбораСотрудников[0], МассивИменПолейОтбораСотрудников[1]);
	
КонецФункции 

&НаСервере
Процедура ДополнитьСтруктуруПараметровИменамиТаблицСКадровойИсториейСотрудников(СтруктураПараметров) Экспорт
	
	ИменаТаблицСКадровойИсториейСотрудников = Новый Структура;
	ИменаТаблицСКадровойИсториейСотрудников.Вставить("ИмяВТКадроваяИсторияСотрудниковТаблицаРегистра", "");
	ИменаТаблицСКадровойИсториейСотрудников.Вставить("ИмяВТКадроваяИсторияСотрудниковСрезПоследних", "");
	
	СтруктураПараметров.Вставить("ИменаТаблицСКадровойИсториейСотрудников", ИменаТаблицСКадровойИсториейСотрудников);
	
КонецПроцедуры

// Возвращает структуру, описывающую временную таблицу отборов физических лиц.
//
// Параметры:
//				ИмяВременнойТаблицыОтборовСотрудников - Строка, имя временной таблицы
//								в менеджере запросов.
//				ИмяПоляСотрудник - Строка, указывает имя поля временной таблицы,
//								содержащего ссылку на сотрудника.
//				ИмяПоляПериод - Строка, указывает имя поля временной таблицу, содержащее
//								период, на который предполагается получить кадровые данные.
//
&НаСервере
Функция ОписаниеВременнойТаблицыОтборовСотрудников(ИмяВременнойТаблицыОтборовСотрудников, ИмяПоляСотрудник = "Сотрудник", ИмяПоляПериод = "Период") Экспорт
	
	ОписательВременнойТаблицыОтборов = Новый Структура;
	ОписательВременнойТаблицыОтборов.Вставить("ИмяВременнойТаблицыОтборовСотрудников", ИмяВременнойТаблицыОтборовСотрудников);
	ОписательВременнойТаблицыОтборов.Вставить("ИмяПоляСотрудник", ИмяПоляСотрудник);
	ОписательВременнойТаблицыОтборов.Вставить("ИмяПоляПериод", ИмяПоляПериод);
	ОписательВременнойТаблицыОтборов.Вставить("ИмяВременнойТаблицыОтборовРазличныхСотрудников", "");
	ОписательВременнойТаблицыОтборов.Вставить("ПутьКПолюОрганизацияФункциональныхОпций", "");
	
	ДополнитьСтруктуруПараметровИменамиТаблицСКадровойИсториейСотрудников(ОписательВременнойТаблицыОтборов);
	
	Возврат ОписательВременнойТаблицыОтборов;
	
КонецФункции

&НаСервере
Функция ЗапросВТКадровыеДанныеСотрудников(ТолькоРазрешенные, ОписательВременнойТаблицыОтборов, КадровыеДанные, ПоляОтбораПериодическихДанных = Неопределено, ФормироватьСПериодичностьДень = Истина, ИсточникиДанных = Неопределено, ИмяВТКадровыеДанныеСотрудников = "ВТКадровыеДанныеСотрудников", ТаблицаОтборовСодержитПолеФизическоеЛицо = Ложь, УничтожитьВспомогательныеТаблицы = Истина) Экспорт
	
	Возврат КадровыйУчетВнутренний.ЗапросВТКадровыеДанныеСотрудников(ТолькоРазрешенные, ОписательВременнойТаблицыОтборов, КадровыеДанные, ПоляОтбораПериодическихДанных, ФормироватьСПериодичностьДень, ИсточникиДанных, ИмяВТКадровыеДанныеСотрудников, ТаблицаОтборовСодержитПолеФизическоеЛицо, УничтожитьВспомогательныеТаблицы);
	
КонецФункции

&НаСервере
Процедура СоздатьВТДанныеДокументовПриемНаРаботу_(МенеджерВременныхТаблиц, МассивОбъектов) Экспорт
	
	ПечатьПоЭлементуСправочника = Ложь;
	Если МассивОбъектов.Количество() > 0 Тогда
		ПечатьПоЭлементуСправочника = ТипЗнч(МассивОбъектов[0]) = Тип("СправочникСсылка.Сотрудники");
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Параметры.Вставить("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПриемНаРаботу.Ссылка КАК Ссылка,
		|	ПриемНаРаботу.ДатаПриема КАК Дата,
		|	ПриемНаРаботу.Сотрудник КАК Сотрудник,
		|	ПриемНаРаботу.ДатаПриема КАК Период,
		|	ПриемНаРаботу.Номер КАК НомерДок,
		|	ПриемНаРаботу.Дата КАК ДатаДок,
		|	ПриемНаРаботу.Руководитель КАК Руководитель,
		|	ПриемНаРаботу.ДолжностьРуководителя КАК ДолжностьРуководителя,
		|	ПриемНаРаботу.УсловияПриема КАК УсловияПриема,
		|	ПриемНаРаботу.ДатаЗавершенияТрудовогоДоговора КАК ДатаЗавершенияТрудовогоДоговора,
		|	0 КАК Надбавка,
		|	ПриемНаРаботу.ДлительностьИспытательногоСрока КАК ДлительностьИспытательногоСрока,
		|	ПриемНаРаботу.РазрешениеНаРаботу КАК РазрешениеНаРаботу,
		|	ПриемНаРаботу.РазрешениеНаПроживание КАК РазрешениеНаПроживание,
		|	ПриемНаРаботу.УсловияОказанияМедпомощи КАК УсловияОказанияМедпомощи,
		|	ПриемНаРаботу.КоличествоСтавок КАК КоличествоСтавок,
		|	ПриемНаРаботу.ТрудовойДоговорДата КАК ТрудовойДоговорДата,
		|	ПриемНаРаботу.ТрудовойДоговорНомер КАК ТрудовойДоговорНомер
		|ПОМЕСТИТЬ ВТДанныеДокументов
		|ИЗ
		|	Документ.ПриемНаРаботу КАК ПриемНаРаботу
		|ГДЕ
		|	ПриемНаРаботу.Проведен
		|	И ПриемНаРаботу.Ссылка В(&МассивОбъектов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПриемНаРаботуСпискомСотрудники.Ссылка,
		|	ПриемНаРаботуСпискомСотрудники.ДатаПриема,
		|	ПриемНаРаботуСпискомСотрудники.Сотрудник,
		|	ПриемНаРаботуСпискомСотрудники.ДатаПриема,
		|	ПриемНаРаботуСпискомСотрудники.Ссылка.Номер,
		|	ПриемНаРаботуСпискомСотрудники.Ссылка.Дата,
		|	ПриемНаРаботуСпискомСотрудники.Ссылка.Руководитель,
		|	ПриемНаРаботуСпискомСотрудники.Ссылка.ДолжностьРуководителя,
		|	ПриемНаРаботуСпискомСотрудники.УсловияПриема,
		|	ПриемНаРаботуСпискомСотрудники.ДатаЗавершенияТрудовогоДоговора,
		|	0,
		|	ПриемНаРаботуСпискомСотрудники.ДлительностьИспытательногоСрока,
		|	ПриемНаРаботуСпискомСотрудники.РазрешениеНаРаботу,
		|	ПриемНаРаботуСпискомСотрудники.РазрешениеНаПроживание,
		|	ПриемНаРаботуСпискомСотрудники.УсловияОказанияМедпомощи,
		|	ПриемНаРаботуСпискомСотрудники.КоличествоСтавок,
		|	ПриемНаРаботуСпискомСотрудники.ТрудовойДоговорДата,
		|	ПриемНаРаботуСпискомСотрудники.ТрудовойДоговорНомер
		|ИЗ
		|	Документ.ПриемНаРаботуСписком.Сотрудники КАК ПриемНаРаботуСпискомСотрудники
		|ГДЕ
		|	ПриемНаРаботуСпискомСотрудники.Ссылка.Проведен
		|	И ПриемНаРаботуСпискомСотрудники.Ссылка В(&МассивОбъектов)";
		
	Если ПечатьПоЭлементуСправочника Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПриемНаРаботу.Ссылка В(&МассивОбъектов)", "ПриемНаРаботу.Сотрудник В(&МассивОбъектов)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПриемНаРаботуСпискомСотрудники.Ссылка В(&МассивОбъектов)", "ПриемНаРаботуСпискомСотрудники.Сотрудник В(&МассивОбъектов)");
	КонецЕсли;
	
	Запрос.Выполнить();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьВТКадровыеДанныеТрудовогоДоговора_(МенеджерВременныхТаблиц, ИмяВременнойТаблицыОтборовСотрудников, ИменаПолейВременнойТаблицыОтборовСотрудников) Экспорт
	
	// Получение кадровых данных сотрудника.
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
		МенеджерВременныхТаблиц,
		ИмяВременнойТаблицыОтборовСотрудников, ИменаПолейВременнойТаблицыОтборовСотрудников);
	
	КадровыеДанные = КадровыеДанныеДляТрудовогоДоговора_();
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, КадровыеДанные);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ОснованиеПредставителя", НСтр("ru='Устава'"));
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КадровыеДанныеСотрудников.ГрафикРаботы,
		|	КадровыеДанныеСотрудников.ГрафикРаботы.ДлительностьРабочейНедели КАК ДлительностьРабочейНедели,
		|	КадровыеДанныеСотрудников.ГрафикРаботы.СокращеннаяРабочаяНеделя КАК СокращеннаяРабочаяНеделя,
		|	КадровыеДанныеСотрудников.ГрафикРаботы.НеполноеРабочееВремя КАК НеполноеРабочееВремя,
		|	СУММА(ВЫБОР
		|		КОГДА ГрафикиРаботыСотрудников.ДеньВключенВГрафик
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК ОписаниеДлительностиРабочейНеделиВДнях,
		|	МАКСИМУМ(ДанныеОРабочихЧасах.Часов) КАК ПродолжительностьРабочегоДня
		|ПОМЕСТИТЬ ВТДанныеГрафиковРаботы
		|ИЗ
		|	ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГрафикиРаботыСотрудников.ШаблонЗаполнения КАК ГрафикиРаботыСотрудников
		|		ПО КадровыеДанныеСотрудников.ГрафикРаботы = ГрафикиРаботыСотрудников.Ссылка
		|			И (ГрафикиРаботыСотрудников.Ссылка.СпособЗаполнения = ЗНАЧЕНИЕ(Перечисление.СпособыЗаполненияГрафиковРаботыСотрудников.ПоНеделям))
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ГрафикиРаботыСотрудниковДанныеОРабочихЧасах.Ссылка КАК Ссылка,
		|			СУММА(ГрафикиРаботыСотрудниковДанныеОРабочихЧасах.Часов) КАК Часов
		|		ИЗ
		|			Справочник.ГрафикиРаботыСотрудников.ДанныеОРабочихЧасах КАК ГрафикиРаботыСотрудниковДанныеОРабочихЧасах
		|		ГДЕ
		|			ГрафикиРаботыСотрудниковДанныеОРабочихЧасах.ВидВремени.РабочееВремя
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ГрафикиРаботыСотрудниковДанныеОРабочихЧасах.Ссылка) КАК ДанныеОРабочихЧасах
		|		ПО КадровыеДанныеСотрудников.ГрафикРаботы = ДанныеОРабочихЧасах.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	КадровыеДанныеСотрудников.ГрафикРаботы,
		|	КадровыеДанныеСотрудников.ГрафикРаботы.ДлительностьРабочейНедели,
		|	КадровыеДанныеСотрудников.ГрафикРаботы.СокращеннаяРабочаяНеделя,
		|	КадровыеДанныеСотрудников.ГрафикРаботы.НеполноеРабочееВремя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеГрафиковРаботы.ДлительностьРабочейНедели,
		|	ДанныеГрафиковРаботы.ОписаниеДлительностиРабочейНеделиВДнях,
		|	ДанныеГрафиковРаботы.СокращеннаяРабочаяНеделя,
		|	ДанныеГрафиковРаботы.НеполноеРабочееВремя,
		|	ДанныеГрафиковРаботы.ПродолжительностьРабочегоДня,
		|	КадровыеДанныеСотрудников.*
		|ПОМЕСТИТЬ ВТКадровыеДанныеТрудовогоДоговора
		|ИЗ
		|	ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеГрафиковРаботы КАК ДанныеГрафиковРаботы
		|		ПО КадровыеДанныеСотрудников.ГрафикРаботы = ДанныеГрафиковРаботы.ГрафикРаботы";
	
	Запрос.Выполнить();
	
КонецПроцедуры 

&НаСервере
Функция КадровыеДанныеДляТрудовогоДоговора_() Экспорт
	
	КадровыеДанные = КадровыеДанныеДляТрудовогоДоговора2();
	
	КадровыеДанные = КадровыеДанные + ",
		|ДатаДоговораКонтракта,
		|НомерДоговораКонтракта,
		|СрочныйДоговор,
		|ДатаОкончания,
		|ОснованиеСрочногоДоговора,
		|ОснованиеПредставителя,
		|КоличествоДнейОсновногоОтпуска,
		|КоличествоДнейОтпускаЗаВредность,
		|КоличествоДнейСеверногоОтпуска,
		|ГрафикРаботы";
	
	Возврат КадровыеДанные;
	
КонецФункции

&НаСервере
Функция КадровыеДанныеДляТрудовогоДоговора2() Экспорт
	
	КадровыеДанные =
		"ГоловнаяОрганизация,
		|Организация,
		|Подразделение,
		|Должность,
		|ВидЗанятости,
		|ФИОПолные,
		|АдресМестаПроживанияПредставление,
		|ДокументПредставление,
		|Страна,
		|КлассУсловийТруда,
		|СтраховойНомерПФР,
		|ПроцентСевернойНадбавки,
		|ТарифнаяСтавка,
		|EMailПредставление";
	
	
	Возврат КадровыеДанные;
	
КонецФункции

&НаСервере
Функция УдалитьПовторяющиесяЭлементыМассива(Массив) Экспорт 
	
	ТекущийИндекс = 0; 
	ВсегоЭлементов = Массив.Количество(); 
	
	Пока ТекущийИндекс < ВсегоЭлементов Цикл
		
		Индекс2 = ТекущийИндекс + 1; 
		
		Пока Индекс2 < ВсегоЭлементов Цикл 
			
			Если Массив[Индекс2].Ссылка = Массив[ТекущийИндекс].Ссылка Тогда 
				Массив.Удалить(Индекс2); 
				ВсегоЭлементов = ВсегоЭлементов - 1; 
			Иначе 
				Индекс2 = Индекс2 + 1; 
			КонецЕсли; 
		КонецЦикла; 
		
		ТекущийИндекс = ТекущийИндекс + 1;
		
	КонецЦикла;
	
	Возврат Массив;

КонецФункции



&НаКлиенте
Процедура ПечатьНаКлиенте(Команда)
	
	ОбъектыНазначения = Новый Массив;
	ОбъектыНазначения.Добавить(Объект.СсылкаНаДокумент);	
	Печать("ШаблонWord_ДС_оклад_должность", ОбъектыНазначения);
	
КонецПроцедуры
